MecaFlux/Poiseuille/case4/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0  -0.5  0)
    (10 -0.5  0)
    (10  0.5  0)
    (0   0.5  0)
    (0  -0.5  0.1)
    (10 -0.5  0.1)
    (10  0.5  0.1)
    (0   0.5  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 10 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    top
    {
        type wall;
        faces ((3 7 6 2));
    }
    bottom
    {
        type wall;
        faces ((0 1 5 4));
    }
    front
    {
        type empty;
        faces ((0 3 2 1));
    }
    back
    {
        type empty;
        faces ((4 5 6 7));
    }
);

mergePatchPairs ();
