MecaFlux/Poiseuille/case4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1890;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       1900;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1910;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2010;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       2110;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       3110;
    }
)

// ************************************************************************* //
